zlgopen/ametal/soc/stm/drivers/source/gpio/am_stm32f103rbt6_gpio.c
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief GPIO驱动，服务GPIO标准接口
 *
 * \internal
 * \par Modification history
 * - 1.00 19-07-04  zc,first implementation
 * \endinternal
 */

#include "am_stm32f103rbt6_gpio.h"
#include "am_gpio_util.h"
#include "am_gpio.h"
#include "am_int.h"
#include "am_bitops.h"
#include "am_stm32f103rbt6_gpio_util.h"
#include "amhw_stm32f103rbt6_afio.h"
#include "amhw_stm32f103rbt6_exti.h"
#include "stm32f103rbt6_pin.h"

/*******************************************************************************
* 私有定义
*******************************************************************************/

/** \brief 中断未连接标识 */
#define AM_STM32F103RBT6_GPIO_INVALID_PIN_MAP    0xFF

/** \brief 定义指向GPIO设备信息的指针 */
#define __GPIO_DEVINFO_DECL(p_gpio_devinfo, p_dev)  \
        const am_stm32f103rbt6_gpio_devinfo_t *p_gpio_devinfo = p_dev->p_devinfo

/******************************************************************************
  全局变量
******************************************************************************/

/** \bruef 指向GPIO设备的指针 */
am_stm32f103rbt6_gpio_dev_t *__gp_gpio_dev;

/*******************************************************************************
  公共函数 关闭外设重映射
*******************************************************************************/

static int __am_stm32f103rbt6_peripheral_remap_clear(int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    amhw_stm32f103rbt6_afio_remap_peripheral_t peripheral;
    amhw_stm32f103rbt6_afio_t                  *p_hw_afio;
    uint8_t i = 0;

    if (NULL == p_gpio_devinfo) {
        return -AM_ENXIO;
    }

    p_hw_afio  = (amhw_stm32f103rbt6_afio_t *)p_gpio_devinfo->afio_regbase;
    peripheral = p_gpio_devinfo->p_remap[pin];

    if (peripheral == AMHW_STM32F103RBT6_NO_REMAP) {
        return -AM_ENXIO;
    }

    /* JATG / SWD 引脚选择性关闭 */
    if (peripheral != AMHW_STM32F103RBT6_SWJ_CFG) {

        /*
         * 将外设在GPIO中重映像的改组引脚全部重置为AMHW_STM32F103RBT6_NO_REMAP
         * 表明改组引脚现在已没有重映像
         */

        for (i = 0 ; i < p_gpio_devinfo->pin_count ; i++) {
            if (p_gpio_devinfo->p_remap[i] == peripheral) {
                p_gpio_devinfo->p_remap[i] = AMHW_STM32F103RBT6_NO_REMAP;
            }
        }

    } else {
        /*
         * JTMS/SWDIO -- PA13   JTCK/SWCLK    -- PA14
         * JTDI       -- PA15   JTDO/TRACESWO -- PB3
         * JNTRST     -- PB4
         *
         * 0  --  无可用引脚
         * 1  --  PB4
         * 2  --  PB3/PB4/PA15
         * 4  --  PB3/PB4/PA15/PA14/PA13
         */
        if ((PIOA_13 == pin) || (PIOA_14 == pin)) {

            amhw_stm32f103rbt6_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_SWJ_CFG_4);

            /* 清除引脚重映像信息 */
            for (i = PIOA_13 ; i < PIOB_5 ; i++) {
                if (p_gpio_devinfo->p_remap[i] == AMHW_STM32F103RBT6_SWJ_CFG) {
                    p_gpio_devinfo->p_remap[i] = AMHW_STM32F103RBT6_NO_REMAP;
                }
            }

            /* 如果使用A15/B3 且模式不是位于7 */
        } else if (((PIOA_15 == pin) || (PIOB_3 == pin)) &&
                 (p_gpio_devinfo->p_remap[PIOA_13] != AMHW_STM32F103RBT6_NO_REMAP)){

            amhw_stm32f103rbt6_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_SWJ_CFG_2);

            /* 清除引脚重映像信息 */
            p_gpio_devinfo->p_remap[PIOB_3]  = AMHW_STM32F103RBT6_NO_REMAP;
            p_gpio_devinfo->p_remap[PIOB_4]  = AMHW_STM32F103RBT6_NO_REMAP;
            p_gpio_devinfo->p_remap[PIOA_15] = AMHW_STM32F103RBT6_NO_REMAP;

        } else if ((PIOB_4 == pin) &&
                 (p_gpio_devinfo->p_remap[PIOB_3] != AMHW_STM32F103RBT6_NO_REMAP)) {

            amhw_stm32f103rbt6_afio_swj_cfg_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_SWJ_CFG_1);

            /* 清除引脚重映像信息 */
            p_gpio_devinfo->p_remap[PIOB_4]  = AMHW_STM32F103RBT6_NO_REMAP;
        }
    }

    /* 关闭外设重映像 */
    switch (peripheral) {

    case AMHW_STM32F103RBT6_SPI1_REMAP:
        amhw_stm32f103rbt6_afio_spi1_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_STM32F103RBT6_I2C1_REMAP:
        amhw_stm32f103rbt6_afio_i2c1_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_STM32F103RBT6_UART1_REMAP:
        amhw_stm32f103rbt6_afio_uart_pin_remap_disable(p_hw_afio, 1);
        break;

    case AMHW_STM32F103RBT6_UART2_REMAP:
        amhw_stm32f103rbt6_afio_uart_pin_remap_disable(p_hw_afio, 2);
        break;

    case AMHW_STM32F103RBT6_UART3_REMAP:
        amhw_stm32f103rbt6_afio_uart3_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_UART3_REMAP_NO);
        break;

    case AMHW_STM32F103RBT6_TIM1_REMAP:
        amhw_stm32f103rbt6_afio_tim1_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_TIM1_REMAP_NO);
        break;

    case AMHW_STM32F103RBT6_TIM2_REMAP:
        amhw_stm32f103rbt6_afio_tim2_remap_mode_set(p_hw_afio, AMHW_STM32F103RBT6_AFIO_TIM2_REMAP_NO);
        break;

    case AMHW_STM32F103RBT6_TIM3_REMAP:
        amhw_stm32f103rbt6_afio_tim3_remap_mode_set(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_TIM3_REMAP_NO);
        break;

    case AMHW_STM32F103RBT6_TIM4_REMAP:
        amhw_stm32f103rbt6_afio_tim4_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_STM32F103RBT6_CAN_REMAP:
        amhw_stm32f103rbt6_afio_can_remap_mode_set(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_CAN_RX_PA11_TX_PA12);
        break;

    case AMHW_STM32F103RBT6_PD01_REMAP:
        amhw_stm32f103rbt6_afio_pd01_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_STM32F103RBT6_TIM5_CH4_REMAP:
        amhw_stm32f103rbt6_afio_tim5_ch4_pin_remap_disable(p_hw_afio);
        break;

    case AMHW_STM32F103RBT6_ADC1_ETRGINJ_REMAP:
        amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGINJ);
        break;

    case AMHW_STM32F103RBT6_ADC1_ETRGREG_REMAP:
        amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGREG);
        break;

    case AMHW_STM32F103RBT6_ADC2_ETRGINJ_REMAP:
        amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC2_ETRGINJ);
        break;

