zlgopen/ametal/soc/stm/drivers/source/gpio/am_stm32f103rbt6_gpio.c
        case AMHW_STM32F103RBT6_PD01_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_pd01_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_pd01_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_STM32F103RBT6_TIM5_CH4_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_tim5_ch4_pin_remap_enable(p_hw_afio);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_tim5_ch4_pin_remap_disable(p_hw_afio);
            }
            break;

        case AMHW_STM32F103RBT6_ADC1_ETRGINJ_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_enable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGINJ);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGINJ);
            }
            break;

        case AMHW_STM32F103RBT6_ADC1_ETRGREG_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_enable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGREG);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC1_ETRGREG);
            }
            break;

        case AMHW_STM32F103RBT6_ADC2_ETRGINJ_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_enable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC2_ETRGINJ);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC2_ETRGINJ);
            }
            break;

        case AMHW_STM32F103RBT6_ADC2_ETRGREG_REMAP:
            if (1 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_enable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC2_ETRGREG);
            } else if (0 == AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags)) {

                amhw_stm32f103rbt6_afio_adc_pin_remap_disable(p_hw_afio ,AMHW_STM32F103RBT6_AFIO_MAPR_ADC2_ETRGREG);
            }
            break;

        case AMHW_STM32F103RBT6_SWJ_CFG:
            amhw_stm32f103rbt6_afio_swj_cfg_remap_mode_set(
                p_hw_afio,
                (amhw_stm32f103rbt6_afio_swj_cfg_mode_t)AM_STM32F103RBT6_GPIO_REMAP_MODE_GET(flags));
            break;

        case AMHW_STM32F103RBT6_NO_REMAP:
            break;

        default:
            return -AM_ENOTSUP;
        }
    }

    return AM_OK;
}

/**
 * \brief 获取GPIO引脚状态
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \return 引脚状态
 */
int am_gpio_get (int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_stm32f103rbt6_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_stm32f103rbt6_gpio_t *)p_gpio_devinfo->gpio_regbase;

    if (amhw_stm32f103rbt6_gpio_pin_dir_get(p_hw_gpio, pin)) {
        return amhw_stm32f103rbt6_gpio_pin_output_get(p_hw_gpio, pin);
    } else {
        return amhw_stm32f103rbt6_gpio_pin_input_get(p_hw_gpio, pin);
    }
}

/**
 * \brief 设置引脚输出状态
 *
 * \param[in] pin   : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] value : 引脚状态，参见
 *                    \ref grp_am_gpio_pin_level
 *
 * \retval  AM_OK   : 操作成功
 */
int am_gpio_set (int pin, int value)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_stm32f103rbt6_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_stm32f103rbt6_gpio_t *)p_gpio_devinfo->gpio_regbase;

    if (value == 0) {
        amhw_stm32f103rbt6_gpio_pin_out_low(p_hw_gpio, pin);
    } else {
        amhw_stm32f103rbt6_gpio_pin_out_high(p_hw_gpio, pin);
    }

    return AM_OK;
}

/**
 * \brief 翻转GPIO引脚输出状态
 * \param[in] pin : 引脚编号，值为 PIO* (#PIOA_0)
 * \retval  AM_OK : 操作成功
 */
int am_gpio_toggle (int pin)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_stm32f103rbt6_gpio_t     *p_hw_gpio  = NULL;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio  = (amhw_stm32f103rbt6_gpio_t *)p_gpio_devinfo->gpio_regbase;

    amhw_stm32f103rbt6_gpio_pin_out_toggle(p_hw_gpio, pin);

    return AM_OK;
}

/**
 * \brief 外部中断线0中断函数
 */
static void __port_exit0_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 0;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_stm32f103rbt6_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_stm32f103rbt6_exti_t   *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_stm32f103rbt6_exti_pr_read(p_hw_exti,
                                 (amhw_stm32f103rbt6_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_stm32f103rbt6_exti_pending_clear(p_hw_exti,
                                   (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线1中断函数
 */
static void __port_exit1_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 1;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_stm32f103rbt6_exti_t   *p_hw_exti   = NULL;

    p_hw_exti   = (amhw_stm32f103rbt6_exti_t *)p_gpio_devinfo->exti_regbase;

    /* 获取有关回调函数及参数 */
    pfn_isr   = p_gpio_devinfo->p_triginfo[slot].pfn_callback;
    p_arg_tmp = p_gpio_devinfo->p_triginfo[slot].p_arg;

    if (amhw_stm32f103rbt6_exti_pr_read(p_hw_exti,
                                 (amhw_stm32f103rbt6_line_num_t)(1ul << slot))) {
        if (pfn_isr != NULL) {
            pfn_isr(p_arg_tmp);
        }
    }

    /* 清中断标志 */
    amhw_stm32f103rbt6_exti_pending_clear(p_hw_exti,
                                   (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
}

/**
 * \brief 外部中断线2中断函数
 */
static void __port_exit2_int_isr (void * p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t  slot = 2;

    am_pfnvoid_t pfn_isr   = NULL;
    void        *p_arg_tmp = NULL;

    amhw_stm32f103rbt6_exti_t   *p_hw_exti   = NULL;

