zlgopen/ametal/soc/stm/drivers/source/gpio/am_stm32f103rbt6_gpio.c
    return AM_OK;
}

/**
 * \brief GPIO去初始化
 *
 * \param[in] 无
 *
 * \return 无
 */
void am_stm32f103rbt6_gpio_deinit (void)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t i;

    if (p_gpio_devinfo->pfn_plfm_deinit) {
        p_gpio_devinfo->pfn_plfm_deinit();
    }

    if (__gp_gpio_dev->valid_flg == AM_FALSE) {
        return;
    }

    for (i = 0 ; i < p_gpio_devinfo->pin_count ; i++) {
        if ((i == PIOA_13) || (i == PIOA_14) || (i == PIOA_15) ||
             (i == PIOB_3) || (i == PIOB_4)) {
            p_gpio_devinfo->p_remap[i] = AMHW_STM32F103RBT6_SWJ_CFG;
        } else {
            p_gpio_devinfo->p_remap[i] = AMHW_STM32F103RBT6_NO_REMAP;
        }
    }

    for (i = 0 ; i < p_gpio_devinfo->exti_num_max ; i++) {
        p_gpio_devinfo->p_infomap[i] = AM_STM32F103RBT6_GPIO_INVALID_PIN_MAP;
        p_gpio_devinfo->p_triginfo[i].p_arg = NULL;
        p_gpio_devinfo->p_triginfo[i].pfn_callback = NULL;
    }

    am_int_disable(p_gpio_devinfo->inum_pin[0]);
    am_int_disable(p_gpio_devinfo->inum_pin[1]);
    am_int_disable(p_gpio_devinfo->inum_pin[2]);
    am_int_disable(p_gpio_devinfo->inum_pin[3]);
    am_int_disable(p_gpio_devinfo->inum_pin[4]);
    am_int_disable(p_gpio_devinfo->inum_pin[5]);
    am_int_disable(p_gpio_devinfo->inum_pin[6]);

    am_int_disconnect(p_gpio_devinfo->inum_pin[0], __port_exit0_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[1], __port_exit1_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[2], __port_exit2_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[3], __port_exit3_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[4], __port_exit4_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[5], __port_exit9_5_int_isr, NULL);
    am_int_disconnect(p_gpio_devinfo->inum_pin[6], __port_exit15_10_int_isr, NULL);

    __gp_gpio_dev = NULL;
}

/**
 * \brief 配置GPIO引脚触发功能
 *
 * \param[in] pin  : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] flag : 配置参数，参见
 *                   \ref grp_am_gpio_pin_trigger_function
 *
 * \retval AM_OK   : 配置成功
 */
int am_gpio_trigger_cfg (int pin, uint32_t flag)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);

    amhw_stm32f103rbt6_gpio_t     *p_hw_gpio  = NULL;
    amhw_stm32f103rbt6_exti_t     *p_hw_exti  = NULL;
    amhw_stm32f103rbt6_afio_t     *p_hw_afio  = NULL;
    uint8_t                 slot       = pin & 0x0f;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    p_hw_gpio = (amhw_stm32f103rbt6_gpio_t *)p_gpio_devinfo->gpio_regbase;
    p_hw_exti = (amhw_stm32f103rbt6_exti_t *)p_gpio_devinfo->exti_regbase;
    p_hw_afio = (amhw_stm32f103rbt6_afio_t *)p_gpio_devinfo->afio_regbase;

    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    if (p_gpio_devinfo->p_infomap[slot] != pin) {
        return -AM_EINVAL;
    }

    /* 使用GPIO功能 */
    __am_stm32f103rbt6_peripheral_remap_clear(pin);

    /* 设置管脚为输入方向 */
    amhw_stm32f103rbt6_gpio_pin_dir_input(p_hw_gpio, pin);

    /* 管脚为上拉/下拉模式 */
    amhw_stm32f103rbt6_gpio_pin_mode_set(p_hw_gpio, AMHW_STM32F103RBT6_GPIO_MODE_IPD, pin);
    /*
     * 中断线0只能连一个端口编号为0的GPIO引脚，比如说，PIOA_0连接到了中断线0，
     * PIOB_0、PIOC_0、PIOD_0就不能连到中断线0, 但此时PIOA_1可以连接到中断线1。
     */
    amhw_stm32f103rbt6_afio_exti_pin_set(p_hw_afio, pin);

    /* 清除中断线配置 */
    amhw_stm32f103rbt6_exti_imr_clear(p_hw_exti,
                               (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
    amhw_stm32f103rbt6_exti_emr_clear(p_hw_exti,
                               (amhw_stm32f103rbt6_line_num_t)(1ul << slot));

    /* 清除中断线触发方式配置 */
    amhw_stm32f103rbt6_exti_rtsr_clear(p_hw_exti,
                                (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
    amhw_stm32f103rbt6_exti_ftsr_clear(p_hw_exti,
                                (amhw_stm32f103rbt6_line_num_t)(1ul << slot));

    switch (flag) {

    case AM_GPIO_TRIGGER_OFF:
        break;

    case AM_GPIO_TRIGGER_RISE:
        /* 使OD位置为0, 表明是下拉 */
        amhw_stm32f103rbt6_gpio_pin_out_low(p_hw_gpio, pin);
        amhw_stm32f103rbt6_exti_rtsr_set(p_hw_exti,
                                  (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
        break;

    case AM_GPIO_TRIGGER_FALL:
        /* 使OD位置为1, 表明是上拉 */
        amhw_stm32f103rbt6_gpio_pin_out_high(p_hw_gpio, pin);
        /* falling  edge */
        amhw_stm32f103rbt6_exti_ftsr_set(p_hw_exti,
                                  (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
        break;

    case AM_GPIO_TRIGGER_BOTH_EDGES:
        /* 使OD位置为1, 表明是上拉 */
        amhw_stm32f103rbt6_gpio_pin_out_high(p_hw_gpio, pin);
        /* falling  edge */
        amhw_stm32f103rbt6_exti_ftsr_set(p_hw_exti,
                                  (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
        amhw_stm32f103rbt6_exti_rtsr_set(p_hw_exti,
                                  (amhw_stm32f103rbt6_line_num_t)(1ul << slot));
        break;

    default:
        return -AM_ENOTSUP;
    }

    return AM_OK;
}

/**
 * \brief 连接回调函数到引脚
 *
 * \param[in] pin          : 引脚编号，值为 PIO* (#PIOA_0)
 * \param[in] pfn_callback : 回调函数指针
 * \param[in] p_arg        : 回调函数的入口参数
 *
 * \retval  AM_OK          : 操作成功
 */
int am_gpio_trigger_connect(int           pin,
                            am_pfnvoid_t  pfn_callback,
                            void         *p_arg)
{
    __GPIO_DEVINFO_DECL(p_gpio_devinfo, __gp_gpio_dev);
    uint8_t                  slot        = pin & 0x0f;
    int key;

    if (__gp_gpio_dev == NULL) {
        return -AM_ENXIO;
    }

    if (AM_FALSE == __gp_gpio_dev->valid_flg) {
        return -AM_ENODEV;
    }

    if (slot > (p_gpio_devinfo->exti_num_max - 1)) {
        return -AM_ENOSPC;
    }

    key = am_int_cpu_lock();

    if (p_gpio_devinfo->p_infomap[slot] == AM_STM32F103RBT6_GPIO_INVALID_PIN_MAP) {

        p_gpio_devinfo->p_infomap[slot] = pin;
        p_gpio_devinfo->p_triginfo[slot].p_arg = p_arg;
        p_gpio_devinfo->p_triginfo[slot].pfn_callback = pfn_callback;

    } else {

        am_int_cpu_unlock(key);
        return -AM_EINVAL;
    }

    am_int_cpu_unlock(key);

